<html>
    <head>
    <title>Google Cloud Translate</title>
    </head>
    <body>
        <?php
            require_once ('vendor/autoload.php');
            use \Statickidz\GoogleTranslate;

            $source = 'bn';
            $target = 'en';
            $text = 'বিএনপির মহাসচিব মির্জা ফখরুল ইসলাম বলেছেন,
             ক্ষমতায় গেলে বিদ্যুৎ ও জ্বালানির দ্রুত সরবরাহ বৃদ্ধি (বিশেষ বিধান) আইন এবং
              রেন্টাল-কুইক রেন্টাল কোম্পানির চুক্তি বাতিল করবে তারা। বিদ্যুৎ ও
               জ্বালানি খাতের সার্বিক অবস্থা নিয়ে আজ শনিবার দুপুরে গুলশানে বিএনপি
                চেয়ারপারসনের কার্যালয়ে এক সংবাদ সম্মেলনে তিনি এসব কথা বলেন।

            বিএনপির মহাসচিব বলেন,
             ‘আমাদের আশার বাণী হচ্ছে, আমরা বিদ্যুতের এই সমস্যার সমাধান করব। আমরা বিদ্যুৎ ও
              জ্বালানি দ্রুত সরবরাহ বৃদ্ধি (বিশেষ বিধান) আইনসহ সব কালাকানুন বাতিল করব।
               রেন্টাল-কুইক রেন্টাল কোম্পানির সঙ্গে সব চুক্তি বাতিল করা হবে।
                স্বচ্ছ প্রতিযোগিতামূলক আন্তর্জাতিক টেন্ডারের মাধ্যমে বিদ্যুৎকেন্দ্র নির্মাণ ও
                 অন্যান্য কাজ সম্পাদন করা হবে।’';

            $trans = new GoogleTranslate();
            $result = $trans->translate($source, $target, $text);

            echo '<h2>'.$result.'</h2>';
        ?>
    </body>
</htmL>